todo_app/todo-mvc/app/controllers/items_controller.rb

  def create
    @list = List.find(params[:list_id])
    @item = @list.items.build(item_params)
    if @item.save
---
SELECT  "lists".* FROM "lists" WHERE "lists"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
INSERT INTO "items" ("description", "list_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["description", "follow the route"], ["list_id", 2], ["created_at", "2019-08-25 20:41:37.057868"], ["updated_at", "2019-08-25 20:41:37.057868"]]