todo_app/todo-mvc/app/controllers/lists_controller.rb

    def create
        @list = List.new(list_params)
        if @list.save
            redirect_to list_url(@list)
        else
            @lists = List.all
---
INSERT INTO "lists" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "fdsa"], ["created_at", "2019-08-25 21:08:17.339393"], ["updated_at", "2019-08-25 21:08:17.339393"]]
SELECT "lists".* FROM "lists"