todo_app/todo-mvc/app/views/lists/show.html.erb

SELECT "items".* FROM "items" WHERE "items"."list_id" = ?  [["list_id", 2]]
---
		<ul class="todo-list">
			<% @list.items.each do |item| %>